Repository: 84000/data-translation-memory
Catalog: Toh_522-The_Dharani_of_the_Tathagata_Jnanolka-v1.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཡེ་ཤེས་ཏ་ལ་ལ་ཞེས་བྱ་བའི་གཟུངས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བ།
en: The Dhāraṇī of the Tathāgata Jñānolka that Purifies All Rebirths

source: ཐམས་ཅད་མཁྱེན་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the Omniscient One.

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all the buddhas and bodhisattvas.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཏ་ལ་ལ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the blessed one, the tathāgata Jñānolka.

source: དེ་བཞིན་གཤེགས་པ་གསེར་གྱི་འོད་བརྩེགས་སྣང་བ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the tathāgata Suvarṇa­prabhākūṭa­nirbhāsa.

source: དེ་བཞིན་གཤེགས་པ་བདེན་གསུང་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the tathāgata Satyavādin.

source: དེ་བཞིན་གཤེགས་པ་འཇིགས་པའི་སྒྲ་སྒྲོགས་རྒྱལ་པོ་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to the tathāgata Bhīkṣmas­varagarjita­rājā.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཞི་པོ་དེ་དག་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་ཟླ་བ་དང་། ཉི་མའི་གནས་ན་བཞུགས་སོ། །
en: The four bodhisattvas—Samanta­bhadra, the youthful Mañjuśrī, Dhāraṇīś­vara­rāja, and Vajrapāṇi— were dwelling in the abode of the Sun and the Moon along with the tathāgatas.

source: དེ་ནས་ལྷའི་བུ་ཟླ་བ་དང་། ཉི་མ་གཉིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ག་ལ་བཞུགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ག་ལ་བ་དེར་སོང་ནས་
en: When the Sun and Moon reached the place where the tathāgatas and bodhisattvas were seated,

source: དེ་གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་རྣམས་རིན་པོ་ཆེ་བཀོད་པའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་པ་རྣམས་དང་། ཁང་པ་བརྩེགས་པ་འཛམ་བུའི་རྒྱལ་མཚན་བརྩེགས་པ་དག་གི་ནང་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་འཁོད་པ་ཡང་མཐོང་ངོ་། །
en: they saw the tathāgatas upon lion thrones bedecked with jewels and the bodhisattvas seated within palaces arrayed with banners bearing the rose apple insignia.

source: དེ་ནས་ལྷའི་བུ་ཟླ་བ་དང་། ཉི་མ་གཉིས་གཅིག་ལ་གཅིག་སེམས་ཏེ།
en: The Sun and Moon each thought,

source: ཇི་ལྟར་བྱས་ན་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་འདི་རྣམས་ལས་སེམས་ཅན་ཐམས་ཅད་ལ་སྣང་བ་སྦྱིན་པ་དང་། མུན་པ་མུན་ནག་བསལ་བའི་ཕྱིར་ཤར་བའི་གཟུངས་སྔགས་ཕྱོགས་བཅུར་ཁྱབ་པའི་བློ་ཅན་ཞེས་བྱ་བ་གང་གི་མཐུས་བདག་ཅག་སེམས་ཅན་ཐམས་ཅད་ལ་སྣང་བར་བྱེད་པ་འཐོབ་པར་འགྱུར་ཞིག་གུ་སྙམ་མོ། །
en: “How can we obtain from these tathāgatas and bodhisattvas the dhāraṇī mantra called the wise one pervading the ten directions, which rises like the dawn to shine a light upon all beings and dispel their thick darkness? With its power we could shine a light upon all sentient beings.”

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ལྷའི་བུ་ཟླ་བ་དང་། ཉི་མ་དེ་དག་གི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས། དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དང་བཅས་པ་དེ་དག་གིས་གཟུངས་སྔགས་འདི་བཀའ་སྩལ་པ།
en: The tathāgatas and bodhisattvas perceived the thoughts of the Sun and Moon and responded with the following dhāraṇī mantra:

source: !སྱཱད་ཡ་ཐེ་དན། ཙཀྵུ་ར་ད་ད། ཙཀྵུ་ཤྴུ་བྷ་དྷུ་ལ་མེ་ཐཱ་ཀ་ལཏྠ། ཨིཏྠནྶ། སཱུ་རཊྚ་སཱུ་རཊྚ། སུཏྠཱ་ཡ། ཨིཏྠནྶ། བེ་ལཱ་བེ་ལཱ། པཱ་ཎི་ཙ་རུ་མཱུརྟི་ནི། ཨཱ་ར་ཎི། ཨཱ་ར་ཎི། ཀཱ་ལ་པཱ་ཎི། ཀཱ་ལ་པཱ་ཎི། དུ་རུ་དུ་རུ། སི་ཏུ་རུ་དུ་ཧ་སི། དྷ་སུ་ཏི་དྷ་སུ་ཏི། དྷི་རི་དྷི་རི། དྷུ་ར་དྷུ་ར། དྷུ་རུ་དྷུ་རུ། ཀཱ་ལ་ཀཱ་ལ། སཏྠཱ་ས། གཱི་ལ་གཱི་ལ། གཱི་ལ་པ་ཡ། གཱི་ལ་པ་ཡ། དྷུ་སུ་དྷུ་སུ། སུནྡྷུ་སུནྡྷུ། སཏྠཱ་སུ། ཨཏྠཱ་སུ། ཨེ་ཐཱ་སུ། ཨེ་ཐཱ་སཱ་བཱ་ནི། ཡུ་ཙུ་རི་དྷེ། སུ་དྷ་རེ། ཀ་ར་ཀ་ར། ཀི་རི་ཀི་རི། ཀུ་རུ་ཀུ་རུ། ཀུརྨ་ཀུརྨ། ཀུརྨ་པཱ་ཎི་ཀུརྨ་པཱ་ཎི། ཀེ་ལུ་ཀེ་ལུ། ཀེ་ལ་པཱ་ཎི་ཀེ་ལ་པཱ་ཎི། ཀརྐཱ་རི་ཀརྐཱ་རི། ལ་རུ་བུདྡྷེ། དྷུ་རུ་དྷེ་དྷུ་རུ་དྷེ། མ་ཧཱ་དྷུ་རུ་དྷེ། ཀ་ར་ཀ་ར། ཀི་ར་ཀི་ར། པི་ཧུ་སི། པི་ཧུ་སི། དྷ་སུ་དྷ་སུ། ཧ་སུ་ཧ་སུ། ཧ་སུ་པ་ནི་སྭཱ་ཧཱ།
en: saryathīva cakṣurdada cakṣuprabha dhulamētha kalatha ithithaṃsa sūrata sūrata suthāsa itithaṃsa vēlu vēlu vēlāpaṇi cārumūrtani āraṇi kālāpaṇi kālāpaṇi tturudhusi turuturudhusi dhāsuti dhāsuti dharadhara dhiridhiri dhurudhuru dhūradhūra kālakāla sathāsa sathāsa gīla gīla gīlāpaya gīlāpaya dhasu dhasu sūṃddhu sūmbhu ēthasu ēthasu ēthasāpaṇi yijuru rede karakara kirikiri kurukuru kurmakurma karmāpaṇi karmāpaṇi karmāpaṇi karmāpaṇi kēlukēlu kēlāpaṇi karkāri karkāri lāru vuddhe dhurude mahādhurude karakara kirikiri piḍhusi piḍhusi dhasu dhasu hasu hasu hasāpaṇi svāhā

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་ལྷའི་བུ་ཟླ་བ་དང་། ཉི་མ་གཉིས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the bodhisattva Samanta­bhadra addressed both the Sun and the Moon, saying,

source: ཀྱཻ་རིགས་ཀྱི་བུ་དག་གཟུངས་སྔགས་འདི་ནི་སེམས་ཅན་ངན་སོང་དུ་འགྲོ་བ་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་སངས་རྒྱས་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞེས་གསུངས་པ་ཡིན་ཏེ།
en: “Sons of the lineage, eighty-four million buddhas have taught this dhāraṇī mantra in order to help beings who are bound for lower rebirth.

source: རིགས་ཀྱི་བུ་དག་ཨུ་དུམ་བ་ར་འི་མེ་ཏོག་ནི་ཆེས་རྙེད་པར་སླའི། གཟུངས་སྔགས་ཀྱི་ཚིག་འདི་དག་ནི་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: Sons of the lineage, it is much easier to find a rare udumbara flower than it is for these dhāraṇī mantra verses to appear in the world.

source: རིགས་ཀྱི་བུ་དག་གཟུངས་སྔགས་ཀྱི་ཚིག་འདི་དག་ནི་ཆེས་རྙེད་པར་སླའི། འདི་དག་ནི་འཆང་བའམ། ཀློག་པ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: Sons of the lineage, obtaining these dhāraṇī mantra verses is much easier than reading and retaining these verses in one’s mind.

source: རིགས་ཀྱི་བུ་དག་སངས་རྒྱས་འབྱུང་བ་ནི་ཆེས་རྙེད་པར་སླའི། གཟུངས་སྔགས་ཀྱི་ཆིག་འདི་དག་འཇིག་རྟེན་དུ་འབྱུང་བ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: Sons of the lineage, it is far more likely for a buddha to appear in the world than it is for these dhāraṇī mantra verses to appear in the world.

source: རིགས་ཀྱི་བུ་དག་གལ་ཏེ་སེམས་ཅན་མནར་མེད་པ་ན་འཁོད་པ་བསྐལ་པར་གནས་པ། མཚམས་མེད་པ་ལྔ་བྱེད་བྱེད་པ། དམ་པའི་ཆོས་སྤོང་བར་བྱེད་པའི་སེམས་ཅན་དེ་དག་གི་ཕྱིར་གཟུངས་སྔགས་ཀྱི་ཆིག་འདི་དག་ཞག་ཉི་ཤུ་རྩ་གཅིག་གི་བར་དུ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་བརྗོད་ན
en: “Sons of the lineage, if one recites these dhāraṇī mantra verses three times a day and three times a night for twenty-one days on behalf of those beings trapped for eons in Avīci hell—namely, those who have committed the five inexpiable acts or who have forsaken the holy Dharma—

source: དེའི་ཚེ་གཟུངས་སྔགས་ཀྱི་ཚིག་འདི་དག་གི་མཐུས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པ་ཁ་བརྒྱར་འགྱེས་པར་འགྱུར་ལ།
en: the power of these verses will open the hundred doors of the great Avīci hell, and

source: སེམས་ཅན་དེ་དག་ཀྱང་ཡོངས་སུ་ཐར་བར་འགྱུར་ན། འཛམ་བུའི་གླིང་པའི་མི་རྣམས་ལྟ་ཅི་སྨོས་ཏེ།
en: those beings will attain liberation. This being the case even for them, it goes without saying that for human beings in Jambudvīpa the same is true.

source: གང་དག་གི་རྣ་ལམ་དུ་གྲག་པར་གྱུར་པ་དེ་དག་གིས་ནི་བདག་ཅག་ནི་དེ་བཞིན་གཤེགས་པ་བཞི་པོ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བཞི་པོ་རྣམས་དང་། ཟླ་བ་དང་། ཉི་མ་རྣམས་ཀྱིས་ཡོངས་སུ་ཟིན་པ་ཡིན་ནོ་སྙམ་དུ་ཤེས་པ་ཁོ་ནར་བྱ་སྟེ
en: “Whoever hears these dhāraṇī mantra verses shall truly know that we, the four tathāgatas, the four bodhisattvas, and the Sun and Moon, support them.

source: !ཏདྱ་ཐཱ། དྷུ་ན་ཊི་དྷུ་ན་ཊི། མ་ཧཱ་དྷུ་ན་ཊི། སུ་རུ་སུ་རུ་སྭཱ་ཧཱ། ཤུཀླ་བི་ཤོ་དྷ་ནི། ཏ་ར་ཏ་ར་སྭཱ་ཧཱ། ཛྱོ་ཏིཥྤྲ་དཱི་པེ། ཏུ་རུ་ཏུ་རུ་སྭཱ་ཧཱ། པདྨ་མཱ་ལི་ནི། སཏྱ་ཏ་ར་བུདྡྷི། ཧུ་རུ་ཧུ་རུ་སྭཱ་ཧཱ། སཏྱ་བུདྡྷི། སཏྱ་ཨ་བ་ལོ་ཀི་ནི། ཀ་ར་ཀ་ར། ཀི་རི་ཀི་རི་སྭཱ་ཧཱ། དྷ་ར་ན་པུ་ཊི་ཨ་པྲ་ཏི་ཧ་ཏ་བུདྡྷི། ཙུ་རུ་ཙུ་རུ་སྭཱ་ཧཱ། ལཀྵ་ཎི་ཙི་ཏེ། དྷཱུ་མ་པ་རི། ཧ་རེ། ཧུ་རུ་ཧུ་རུ། ཁུ་རུ་ཁུ་རུ་སྭཱ་ཧཱ། དྷ་ར་དྷ་ར། མཱ་དྷ་ར། དྷ་ར་དྷ་ར། དྷ་ར་ཡནྟི་ཡེ་སྭཱ་ཧཱ། སུ་པྲ་ཏི། སུ་མ་ཏི། ཨ་པྲ་ཏི་ཧ་ཏ། བུདྡྷི། དྷ་ར་དྷ་ར། དྷ་ར་ཡནྟི་ཡེ་སྭཱ་ཧཱ།
en: dhunaṭi mahādhuṇati surusuru svāhā śuklaviśōdhani taratara svāhā || jyōtipradīpe turuturu svāhā || padmamālani sattyatarabudhe huruhuru svāhā satyabuddhe saty'ālōkani kirikiri svāhā || dhāraṇibuddhi apratihatabuddhi curucuru svāhā || lakṣaṇârcite dhūmaparihāre khurukhuru dhāra mahādhāra dharadhara yaṃ ttîye svāhā || avrrate sutape apratihatabuddhi dharadhara yam tîye svāhā ||

source: !སྭཱ་ཧཱ།
en: Make these mantra verses effective! Svāhā!”

source: འཕགས་པ་ཡེ་ཤེས་ཏ་ལ་ལ་ཞེས་བྱ་བའི་གཟུངས་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་བ་རྫོགས་སོ།།
en: This concludes “The Noble Dhāraṇī of the Tathāgata Jñānolka that Purifies All Rebirths.”
